# Application Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIDocument..::..Application Property
UIDocument Class See Also
---
Retrieves an object that represents the current Application.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UIApplication Application { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Application As UIApplication
	Get
```

Visual C++
---
```text
public:
property UIApplication^ Application {
	UIApplication^ get ();
}
```

# See Also
UIDocument Class
Autodesk.Revit.UI Namespace